ctrl + u 打开首选项->打开   基于整体范围的选择   (可以在单击时间轴选择一个区域,而不是一帧)

选中图形 ->右键=>分离到图层

窗口=>电影浏览器  ,看结构
窗口=>其它=>场景  可以新增加场景,也可插入->场景
视图=>标尺/网络
插入->时间轴特效

修改->形状->平滑/伸直 和 工具栏的两个按钮相同
修改->形状->柔化填充边缘  (边 模糊效果,也可得到边)
修改->形状->增加形状提示 ,变形动画
修改->形状->   颜色阀值　设置为1， 精细，由点组成，容量大，速度慢  ,还是用分离　ctrl+b

控制->启用简单按钮，在场景中可以点按钮而不是选中

库面板有－＞立即更新使用次数　，可以删除使用次数为０
右击库中的影片－＞链接－＞为运行时共享导出

庶罩层要锁定才能生效


 

导入声音时，同步选择　数据流　　就可以在播放时间轴时播放音乐，下载一半时就可以听
选中帧　-> 翻转帧


flash 播放器中　视图->带宽设置->
		调试->变量列表

文本属性有一个　可选　的属性



=====Action Script 3

this.mybutton.addEventListener(MouseEvent.CLICK,
	function (evt:MouseEvent)
	{
		play();
	});

=====Action Script 3







































