Visual Studio 2019 中有这个库，使用C++开发 (Unity使用C#开发，过去12个月整体财务规模达到20万美金以上的企业需购买,按年收费)
可以运行的平台包括三个桌面系统(windows,linux,MacOS),两大移动平台(Anroid,iOS)及 XBox，PlayStation
UE(UnrealEngine) 目前最新4版本为4.27版本, 有5的版本,(虚幻引擎5取消了对32位平台的支持。)
发行收费，100万美元以后开始收5%分成费

虽然锐龙5600G的核心还不足以应对大型3A游戏，但是对于主流游戏已经具有很强的可玩性
3A游戏泛指的是高成本、高质量、高体量的单机游戏

官方有介绍在github上有源代码 
https://github.com/EpicGames/UnrealEngine

下载 要 Epic  帐户

https://docs.unrealengine.com/4.27/en-US/SharingAndReleasing/Mobile/Android/


=====蓝图
距离单位是CM

ctrl+alt+拖框选
设置->严格的合适选择，表示要全框在里面才会被选中，不是交上的被选中
设置->框选的遮蔽物体，表示可以选中背面看不见的物体
设置->显示变换控件，即可以移动物体的标志

（可用滚轮加快减慢速度，视图右上角第二个按钮 相机速度 也可设置）
右键   旋转视图
右键+W 看视图
右键+D 
右键+S
右键+D 

q 视图下降
e 视图上升

也可选择对象 按alt+拖(右键) 像Maya
alt+中键 （中键）平移

f 对选中对象最大化显示



视图左上角三角号按钮->远景平面，表示只显示（渲染）指定距离内的物体，远的就不显示（渲染）了
	->g 游戏模式 ，会隐藏 如移动物体的标志
	->f11全屏切换
	->书签 可以保存视图视角
	->从这里创建相机
视图右上角按钮，可当前视图最大化或取消
	
视图 光照菜单->爆光设置，临时设置的，运行游戏时不使用这个值 
视图 世界/本地空间 ，变换坐标系是物体自身的，还是整个场景的

移动时按V键会捕捉






